lib/tasks/tickets.rake

INSERT INTO "ticket_priorities" ("name", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Baja"], ["priority", 1], ["created_at", "2021-06-09 16:22:23.281281"], ["updated_at", "2021-06-09 16:22:23.281281"]]
INSERT INTO "ticket_statuses" ("name", "sort", "default", "system_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Abierto"], ["sort", 1], ["default", 1], ["system_status", 1], ["created_at", "2021-06-09 16:22:23.651051"], ["updated_at", "2021-06-09 16:22:23.651051"]]
INSERT INTO "ticket_sources" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "TICKET"], ["created_at", "2021-06-09 16:22:23.959695"], ["updated_at", "2021-06-09 16:22:23.959695"]]
INSERT INTO "questions" ("name", "campo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "¿En cuanto a la atención de su requerimiento?"], ["campo", "rb_1"], ["created_at", "2021-06-09 16:22:24.080303"], ["updated_at", "2021-06-09 16:22:24.080303"]]
INSERT INTO "questions" ("name", "campo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "¿Cómo fue la atención para solucionar su requerimiento?"], ["campo", "rb_2"], ["created_at", "2021-06-09 16:22:24.213169"], ["updated_at", "2021-06-09 16:22:24.213169"]]
INSERT INTO "questions" ("name", "campo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "¿Cuál es la probabilidad de que nos recomiende con sus conocidos?"], ["campo", "rb_3"], ["created_at", "2021-06-09 16:22:24.291437"], ["updated_at", "2021-06-09 16:22:24.291437"]]
INSERT INTO "questions" ("name", "campo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "En general ¿qué tan satisfecho esta con esta compañía?"], ["campo", "rb_4"], ["created_at", "2021-06-09 16:22:24.367361"], ["updated_at", "2021-06-09 16:22:24.367361"]]
INSERT INTO `questions` (`name`, `campo`, `created_at`, `updated_at`) VALUES ('¿Cual es el aspecto ó aspectos que mejoraría en su experiencia con nuestra marca?', 'txs_1', '2021-06-14 12:41:20', '2021-06-14 12:41:20')
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1.-Altamente Satisfecho"], ["valor", "1"], ["question_id", 1], ["created_at", "2021-06-09 16:22:24.537011"], ["updated_at", "2021-06-09 16:22:24.537011"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2.-Muy Satisfecho"], ["valor", "2"], ["question_id", 1], ["created_at", "2021-06-09 16:22:24.636247"], ["updated_at", "2021-06-09 16:22:24.636247"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "3.-Satisfecho"], ["valor", "3"], ["question_id", 1], ["created_at", "2021-06-09 16:22:24.724840"], ["updated_at", "2021-06-09 16:22:24.724840"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "4.-Poco Satisfecho"], ["valor", "4"], ["question_id", 1], ["created_at", "2021-06-09 16:22:24.836583"], ["updated_at", "2021-06-09 16:22:24.836583"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "5.-Completamente insatisfecho"], ["valor", "5"], ["question_id", 1], ["created_at", "2021-06-09 16:22:24.924579"], ["updated_at", "2021-06-09 16:22:24.924579"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1.-Rápida, pues solucionaron al momento"], ["valor", "1"], ["question_id", 2], ["created_at", "2021-06-09 16:22:25.013136"], ["updated_at", "2021-06-09 16:22:25.013136"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2.-Tuve que esperar, pero me solucionaron"], ["valor", "2"], ["question_id", 2], ["created_at", "2021-06-09 16:22:25.091088"], ["updated_at", "2021-06-09 16:22:25.091088"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "3.-Insuficiente, pues no recibí solución"], ["valor", "3"], ["question_id", 2], ["created_at", "2021-06-09 16:22:25.179878"], ["updated_at", "2021-06-09 16:22:25.179878"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1.-Si los recomiendo"], ["valor", "1"], ["question_id", 3], ["created_at", "2021-06-09 16:22:25.257945"], ["updated_at", "2021-06-09 16:22:25.257945"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2.-Es muy probable"], ["valor", "2"], ["question_id", 3], ["created_at", "2021-06-09 16:22:25.358380"], ["updated_at", "2021-06-09 16:22:25.358380"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "3.-Es probable"], ["valor", "3"], ["question_id", 3], ["created_at", "2021-06-09 16:22:25.457900"], ["updated_at", "2021-06-09 16:22:25.457900"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "4.-Es poco probable"], ["valor", "4"], ["question_id", 3], ["created_at", "2021-06-09 16:22:25.558556"], ["updated_at", "2021-06-09 16:22:25.558556"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1.-Altamente Satisfecho"], ["valor", "1"], ["question_id", 4], ["created_at", "2021-06-09 16:22:25.658133"], ["updated_at", "2021-06-09 16:22:25.658133"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2.-Muy Satisfecho"], ["valor", "2"], ["question_id", 4], ["created_at", "2021-06-09 16:22:25.769223"], ["updated_at", "2021-06-09 16:22:25.769223"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "3.-Satisfecho"], ["valor", "3"], ["question_id", 4], ["created_at", "2021-06-09 16:22:25.847090"], ["updated_at", "2021-06-09 16:22:25.847090"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "4.-Poco Satisfecho"], ["valor", "4"], ["question_id", 4], ["created_at", "2021-06-09 16:22:25.946893"], ["updated_at", "2021-06-09 16:22:25.946893"]]
INSERT INTO "question_threads" ("name", "valor", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "5.-Completamente insatisfecho"], ["valor", "5"], ["question_id", 4], ["created_at", "2021-06-09 16:22:26.047079"], ["updated_at", "2021-06-09 16:22:26.047079"]]
---
  task init: :environment do
    TicketPriority.create([
      { name: 'Baja',    color: nil, priority: 1 },
      { name: 'Normal',  color: nil, priority: 2 },
      { name: 'Alta',    color: nil, priority: 3 },
      { name: 'Urgente', color: nil, priority: 4 }
    ])

    TicketStatus.create([
      { name: 'Abierto', sort: 1, default: 1, system_status: 1 },
      { name: 'Cerrado', sort: 2, system_status: 1 },
    ])

    TicketSource.create(name: 'TICKET')

    Question.create(name: '¿En cuanto a la atención de su requerimiento?', campo: 'rb_1')
    Question.create(name: '¿Cómo fue la atención para solucionar su requerimiento?', campo: 'rb_2')
    Question.create(name: '¿Cuál es la probabilidad de que nos recomiende con sus conocidos?', campo: 'rb_3')
    Question.create(name: 'En general ¿qué tan satisfecho esta con esta compañía?', campo: 'rb_4')
    Question.create(name: '¿Cual es el aspecto ó aspectos que mejoraría en su experiencia con nuestra marca?', campo: 'txs_1')

    QuestionThread.create(name: '1.-Altamente Satisfecho', valor: 1, question_id: 1)
    QuestionThread.create(name: '2.-Muy Satisfecho', valor: 2, question_id: 1)
    QuestionThread.create(name: '3.-Satisfecho', valor: 3, question_id: 1)
    QuestionThread.create(name: '4.-Poco Satisfecho', valor: 4, question_id: 1)
    QuestionThread.create(name: '5.-Completamente insatisfecho', valor: 5, question_id: 1)
    QuestionThread.create(name: '1.-Rápida, pues solucionaron al momento', valor: 1, question_id: 2)
    QuestionThread.create(name: '2.-Tuve que esperar, pero me solucionaron', valor: 2, question_id: 2)
    QuestionThread.create(name: '3.-Insuficiente, pues no recibí solución', valor: 3, question_id: 2)
    QuestionThread.create(name: '1.-Si los recomiendo', valor: 1, question_id: 3)
    QuestionThread.create(name: '2.-Es muy probable', valor: 2, question_id: 3)
    QuestionThread.create(name: '3.-Es probable', valor: 3, question_id: 3)
    QuestionThread.create(name: '4.-Es poco probable', valor: 4, question_id: 3)
    QuestionThread.create(name: '1.-Altamente Satisfecho', valor: 1, question_id: 4)
    QuestionThread.create(name: '2.-Muy Satisfecho', valor: 2, question_id: 4)
    QuestionThread.create(name: '3.-Satisfecho', valor: 3, question_id: 4)
    QuestionThread.create(name: '4.-Poco Satisfecho', valor: 4, question_id: 4)
    QuestionThread.create(name: '5.-Completamente insatisfecho', valor: 5, question_id: 4)