app/views/tickets/_form.html.erb

SELECT `clients`.* FROM `clients` ORDER BY `clients`.`name` ASC
---
      <div class="d-flex">
        <%= form.collection_select :client_id, Client.select_options, :id, :name, { include_blank: '-', selected: @ticket.client_id }, { class: 'form-control' } %>

SELECT  "ticket_statuses".* FROM "ticket_statuses" WHERE "ticket_statuses"."status" = ? AND "ticket_statuses"."default" = ? LIMIT ?  [["status", 1], ["default", 1], ["LIMIT", 1]]
---
    <div class="col-lg-10">
      <%= form.collection_select :ticket_status_id, TicketStatus.select_options, :id, :name, { include_blank: '-', selected: @ticket.ticket_status_id || TicketStatus.current_default.id }, { class: 'form-control' } %>

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL
---
    <div class="col-lg-10">
      <%= form.collection_select :assigned_user_id, User.select_options, :id, :name, { include_blank: '-', selected: @ticket.assigned_user_id }, { class: 'form-control' } %>