app/views/tickets/index.html.erb

SELECT `clients`.* FROM `clients` ORDER BY `clients`.`name` ASC
---
                    <label for="client_id">Cliente</label>
                    <%= collection_select nil, :client_id, Client.select_options, :id, :name, { include_blank: '-', selected: params[:client_id] }, { class: 'form-control' } %>

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL
---
                    <label for="assigned_user_id">Asignado</label>
                    <%= collection_select nil, :assigned_user_id, User.select_options, :id, :name, { include_blank: '-', selected: params[:assigned_user_id] }, { class: 'form-control' } %>