app/views/tickets/show.html.erb

                    <%= form_for(@ticket, local: true) do |form| %>
                      <%= form.collection_select :assigned_user_id, User.select_options, :id, :name, { include_blank: '-', selected: @ticket.assigned_user_id }, { class: '', onchange: 'this.form.submit()', style: 'width: 150px' } %>
---
SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL

            <tbody>
                <% @ticket.ticket_issues.order(created_at: :desc).each do |ticket_issues| %>
---
SELECT "ticket_issues".* FROM "ticket_issues" WHERE "ticket_issues"."ticket_id" = ? ORDER BY "ticket_issues"."created_at" DESC  [["ticket_id", 1]]

        <div class="ticket-threads-list">
          <% @ticket.ticket_threads.includes(:creator).order(created_at: :desc).each do |ticket_thread| %>
---
SELECT "ticket_threads".* FROM "ticket_threads" WHERE "ticket_threads"."ticket_id" = ? ORDER BY "ticket_threads"."created_at" DESC  [["ticket_id", 1]]