app/controllers/api/v1/tickets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = '' LIMIT 1
SELECT  `ticket_statuses`.* FROM `ticket_statuses` WHERE `ticket_statuses`.`default` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'frodriguez' LIMIT 1
INSERT INTO `tickets` (`uuid`, `title`, `client_id`, `ticket_status_id`, `ticket_source_id`, `creator_type`, `creator_id`, `created_at`, `updated_at`) VALUES (x'61333439326538342d353366352d346362382d393436382d376436616536346131653336', 'casodelticketdesdeapi', 3, 1, 1, 'User', 1, '2021-06-16 15:30:39', '2021-06-16 15:30:39')
INSERT INTO `ticket_sources` (`name`, `created_at`, `updated_at`) VALUES ('', '2021-06-16 15:28:21', '2021-06-16 15:28:21')
SELECT  `ticket_sources`.* FROM `ticket_sources` WHERE `ticket_sources`.`name` = '' LIMIT 1
---
  def create
    email = request.headers["X-GEO-TICKETCREATOR"].to_s
    creator_user = User.find_by(email: email)
    creator_user = User.create(email: email, password: SecureRandom.hex) if creator_user.nil?

    @ticket = Ticket.new(ticket_params.merge(creator: creator_user))
    @ticket.ticket_status = TicketStatus.find_by(default: 1)

    @ticket.assigned_user = User.find_by(name: "frodriguez")

    appname = request.headers["X-GEO-APPNAME"].to_s.upcase
    @ticket.ticket_source = TicketSource.find_or_create_by(name: appname)

    if @ticket.save