app/views/ticket_send_mailer/send_signup_email.html.erb


                 <% @ticket.ticket_threads.thread_type_limit.each do |t| %>
---
SELECT  "ticket_threads".* FROM "ticket_threads" WHERE "ticket_threads"."ticket_id" = ? AND (thread_type = 1) ORDER BY "ticket_threads"."created_at" DESC LIMIT ?  [["ticket_id", 1], ["LIMIT", 1]]