app/controllers/reports_controller.rb

SELECT COUNT(*) AS count_all, departaments.name AS departaments_name, `tickets`.`ticket_status_id` AS tickets_ticket_status_id FROM `tickets` INNER JOIN `users` ON `users`.`id` = `tickets`.`assigned_user_id` INNER JOIN `departaments` ON `departaments`.`id` = `users`.`departament_id` GROUP BY departaments.name, `tickets`.`ticket_status_id`
---
  def set_query

    @data = Ticket.joins([assigned_user: :departament],:ticket_status).group("ticket_statuses.name","departaments.name").count