app/controllers/tickets_controller.rb

  def show

    @ticket_thread = TicketThread.new
    #habilita cambio de estado para el usuario asignado al ticket
    current_user&.id  != @ticket.assigned_user_id or @ticket.ticket_status_id == 2 ? @habilita_estado = false : @habilita_estado = true
    #habilita cambio de datos slo si esta abieto ticket

    @ticket.ticket_status_id == 2 ? @habilita_datos = false : @habilita_datos = true
    #el si se cieera el estado del ticket nl podran cambiar nada
    @ticket.ticket_status_id == 2 ? @habilita_estado_save = false : @habilita_estado_save = true

    #para ubicar el nombre del departamento que pertenece el usuario
    id_dep = @ticket.assigned_user&.departament_id
    id_dep.nil? ? @dep="" :  @dep=Departament.select("name").find(id_dep).name
---
SELECT  "departaments"."name" FROM "departaments" WHERE "departaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @ticket = Ticket.new(ticket_params.merge(creator: current_user))

    respond_to do |format|
      if @ticket.save
---
INSERT INTO `tickets` (`uuid`, `title`, `client_id`, `ticket_priority_id`, `ticket_status_id`, `ticket_source_id`, `assigned_user_id`, `creator_type`, `creator_id`, `created_at`, `updated_at`) VALUES (x'34316365343461302d633163612d343832372d383466312d333131386563386464303239', 'prueba adjunto', 1, 1, 1, 1, 2, 'User', 1, '2021-06-15 18:30:31', '2021-06-15 18:30:31')