app/controllers/ticket_threads_controller.rb

INSERT INTO "ticket_threads" ("body", "thread_type", "ticket_id", "creator_type", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket_thread = @ticket.ticket_threads.new(ticket_thread_params.merge(creator: current_user))
    #vsendemail=params[:ticket_thread][:send_email]
    vsendemail=params[:ticket_thread][:thread_type]

      respond_to do |format|
        if @ticket_thread.save