app/models/ticket_status.rb

  scope :current_default, -> { where(status: :enabled).find_by(default: 1) }
---
SELECT  "ticket_statuses".* FROM "ticket_statuses" WHERE "ticket_statuses"."status" = ? AND "ticket_statuses"."default" = ? LIMIT ?  [["status", 1], ["default", 1], ["LIMIT", 1]]