app/models/ticket.rb

  def client_attributes=(client_attributes)
    return if self.client_source == 'select'

    c = Client.find_or_initialize_by(email: client_attributes[:email])
    c.name = client_attributes[:name]
    c.phone = client_attributes[:phone] unless client_attributes[:phone].blank?
---
SELECT  "clients".* FROM "clients" WHERE "clients"."email" = ? LIMIT ?  [["email", "cliente1@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM `clients` WHERE `clients`.`email` = BINARY 'micliente@gmail.com' AND `clients`.`id` != 3 LIMIT 1