app/views/reports/_form.html.erb

   <div class="form-group mx-sm-3 mb-2">
    <%= select_tag :cliente_id, options_from_collection_for_select(Client.all, "id", "name", params[:cliente_id]), prompt: "Cliente", class: "form-control" %>
---
SELECT `clients`.* FROM `clients`

  <div class="form-group mx-sm-3 mb-2">
    <%= select_tag :status_id, options_from_collection_for_select(TicketStatus.all, "id", "name", params[:status_id]), prompt: "Estatus", class: "form-control" %>
---
SELECT `ticket_statuses`.* FROM `ticket_statuses`

 <div class="form-group mx-sm-3 mb-2">
    <%= select_tag :priority_id, options_from_collection_for_select(TicketPriority.all, "id", "name", params[:priority_id]), prompt: "Prioridad", class: "form-control" %>
---
SELECT `ticket_priorities`.* FROM `ticket_priorities`

  <div class="form-group mx-sm-3 mb-2">
    <%= select_tag :asigned_user_id, options_from_collection_for_select(User.all, "id", "name", params[:asigned_user_id]), prompt: "Asignado", class: "form-control" %>
---
SELECT `users`.* FROM `users`